## How to import data from a database into Python

Author: tygithub18

Date: 1/18/2018

Often time, when working with large amounts of data it will be stored in a database instead of as a CSV file on your desktop. This is an example of how I stored data into a MySQL database on my computer and imported a table into a Pandas dataframe.

This lesson is meant to tie in with my previous one about creating and opening large datasets. With these, you will be able to create a large dataset in Python from scratch or use Python to merge several files together into one large CSV. Then you can load the CSV into a database or import it into Python directory. Lastly, if you imported it into a database, this guide will show you how to import it into Python. You can export your work as a CSV using the previous guides.

If you don't have a password, you can leave it blank or do what I did.

https://stackoverflow.com/questions/37730243/importing-data-from-a-mysql-database-into-a-pandas-data-frame-including-column-n

In [1]:
import mysql.connector as sql
import pandas as pd

db_connection = sql.connect(host='localhost', database='mydb', user='root', password = '')
db_cursor = db_connection.cursor()
db_cursor.execute('SELECT * FROM player_team')

table_rows = db_cursor.fetchall()

df = pd.DataFrame(table_rows)

db_cursor.close()
db_connection.close()

In [2]:
df

   0         1         2
0  1     Brady  Patriots
1  2   Manning    Giants
2  3     Bress    Saints
3  4  Prescott   Cowboys
4  5    Wilson  Seahawks
5  7    Flacco    Ravens
6  8     Wentz    Eagles

In [3]:
df.columns = ['Player_ID', 'Player_Name', "Player_Team"]
df

   Player_ID Player_Name Player_Team
0          1       Brady    Patriots
1          2     Manning      Giants
2          3       Bress      Saints
3          4    Prescott     Cowboys
4          5      Wilson    Seahawks
5          7      Flacco      Ravens
6          8       Wentz      Eagles

In [4]:
df= df.set_index('Player_ID')

In [5]:
df

          Player_Name Player_Team
Player_ID
1               Brady    Patriots
2             Manning      Giants
3               Bress      Saints
4            Prescott     Cowboys
5              Wilson    Seahawks
7              Flacco      Ravens
8               Wentz      Eagles

## Update/Insert a record into MySQL

https://www.w3schools.com/python/python_mysql_insert.asp

In [6]:
import mysql.connector

In [7]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="",
  database="mydb"
)

In [8]:
mycursor = mydb.cursor()

In [9]:
sql = "INSERT INTO player_team (Player_ID, Player_Name, Player_Team) VALUES (%s, %s, %s)"
val = (6, "Smith", "Redskins")

In [10]:
mycursor.execute(sql, val)

In [11]:
mycursor.execute('SELECT * FROM player_team')

In [12]:
table_rows = mycursor.fetchall()

df2 = pd.DataFrame(table_rows)

In [13]:
df2.columns = ['Player_ID', 'Player_Name', "Player_Team"]
df2= df2.set_index('Player_ID')
df2

          Player_Name Player_Team
Player_ID
1               Brady    Patriots
2             Manning      Giants
3               Bress      Saints
4            Prescott     Cowboys
5              Wilson    Seahawks
6               Smith    Redskins
7              Flacco      Ravens
8               Wentz      Eagles

In [14]:
mydb.commit()

In [15]:
print("Record inserted.")

Record inserted.

In [16]:
mycursor.close()

True

In [17]:
mydb.close()